
class Node(object):
    def __init__(self, name):
        self.name = name
        self.left = None
        self.right = None

class WuXingLink(object):
    def __init__(self):
        self.mu = Node('木')
        self.huo = Node('火')
        self.tu = Node('土')
        self.jin = Node('金')
        self.shui = Node('水')
        self.attrs = [self.mu, self.huo, self.tu, self.jin, self.shui]

    def improve(self):
        self.mu.left = self.shui
        self.mu.right = self.huo
        self.huo.left = self.mu
        self.huo.right = self.tu
        self.tu.left = self.huo
        self.tu.right = self.jin
        self.jin.left = self.tu
        self.jin.right = self.shui
        self.shui.left = self.jin
        self.shui.right = self.mu

    def impair(self):
        self.mu.left = self.jin
        self.mu.right = self.tu
        self.huo.left = self.shui
        self.huo.right = self.jin
        self.tu.left = self.mu
        self.tu.right = self.shui
        self.jin.left = self.huo
        self.jin.right = self.mu
        self.shui.left = self.tu
        self.shui.right = self.huo

    def who_improve_me(self, attr):
        self.improve()
        for node in self.attrs:
            if node.name == attr:
                return node.left.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def me_improve_who(self, attr):
        self.improve()
        for node in self.attrs:
            if node.name == attr:
                return node.right.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def who_impair_me(self, attr):
        self.impair()
        for node in self.attrs:
            if node.name == attr:
                return node.left.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def me_impair_who(self, attr):
        self.impair()
        for node in self.attrs:
            if node.name == attr:
                return node.right.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

Wx_2_Season = {'木': '春', '火': '夏', '金': '秋', '水': '冬', '土': '四季'}

Wx_2_Direction = {'木': '东', '火': '南', '金': '西', '水': '北', '土': '中'}

Season_Wx_Trend = {
    '春': {'木':'旺', '火':'相', '水':'休', '金':'囚', '土':'死'},
    '夏': {'火': '旺', '土': '相', '木': '休', '水': '囚', '金': '死'},
    '秋': {'金': '旺', '水': '相', '土': '休', '火': '囚', '木': '死'},
    '冬': {'水': '旺', '木': '相', '金': '休', '土': '囚', '火': '死'},
    '四季': {'土': '旺', '金': '相', '火': '休', '木': '囚', '水': '死'}
}

# 寄生十二宫
JiShengTwelveGong = {
    '甲木': {'亥':'长生', '子':'沐浴', '丑':'冠带', '寅':'临官', '卯':'帝旺', '辰':'衰',
             '巳':'病', '午':'死', '未':'墓', '申':'绝', '酉':'胎', '戌':'养'},
    '丙火': {'寅': '长生', '卯': '沐浴', '辰': '冠带', '巳': '临官', '午': '帝旺', '未': '衰',
             '申': '病', '酉': '死', '戌': '墓', '亥': '绝', '子': '胎', '丑': '养'},
    '戊土': {'寅': '长生', '卯': '沐浴', '辰': '冠带', '巳': '临官', '午': '帝旺', '未': '衰',
             '申': '病', '酉': '死', '戌': '墓', '亥': '绝', '子': '胎', '丑': '养'},
    '庚金': {'巳': '长生', '午': '沐浴', '未': '冠带', '申': '临官', '酉': '帝旺', '戌': '衰',
             '亥': '病', '子': '死', '丑': '墓', '寅': '绝', '卯': '胎', '辰': '养'},
    '壬水': {'申': '长生', '酉': '沐浴', '戌': '冠带', '亥': '临官', '子': '帝旺', '丑': '衰',
             '寅': '病', '卯': '死', '辰': '墓', '巳': '绝', '午': '胎', '未': '养'},
    '乙木': {'午': '长生', '巳': '沐浴', '辰': '冠带', '卯': '临官', '寅': '帝旺', '丑': '衰',
             '子': '病', '亥': '死', '戌': '墓', '酉': '绝', '申': '胎', '未': '养'},
    '丁火': {'酉': '长生', '申': '沐浴', '未': '冠带', '午': '临官', '巳': '帝旺', '辰': '衰',
             '卯': '病', '寅': '死', '丑': '墓', '子': '绝', '亥': '胎', '戌': '养'},
    '己土': {'酉': '长生', '申': '沐浴', '未': '冠带', '午': '临官', '巳': '帝旺', '辰': '衰',
             '卯': '病', '寅': '死', '丑': '墓', '子': '绝', '亥': '胎', '戌': '养'},
    '辛金': {'子': '长生', '亥': '沐浴', '戌': '冠带', '酉': '临官', '申': '帝旺', '未': '衰',
             '午': '病', '巳': '死', '辰': '墓', '卯': '绝', '寅': '胎', '丑': '养'},
    '癸水': {'卯': '长生', '寅': '沐浴', '丑': '冠带', '子': '临官', '亥': '帝旺', '戌': '衰',
             '酉': '病', '申': '死', '未': '墓', '午': '绝', '巳': '胎', '辰': '养'}
}

#刑冲害化合
Xing_Zhi = (('子', '卯'), ('寅', '巳', '申'), ('丑', '未', '戌'))        # 即三刑
Chong_Gan = (('甲', '庚'), ('乙', '辛'), ('壬', '丙'),  ('癸', '丁'))
Chong_Zhi = (('子', '午'), ('丑', '未'), ('寅', '申'), ('卯', '酉'), ('辰', '戌'), ('巳', '亥'))    # 即六冲
Hai_Zhi = (('子', '未'), ('丑', '午'), ('寅', '巳'), ('卯', '辰'), ('申', '亥'), ('酉', '戌'))      # 即六害
Hua_Gan = (('甲', '己'), ('乙', '庚'), ('丙', '辛'),('壬', '丁'),  ('癸', '戊'))    # 即五化
He_Zhi_6 = {('子', '丑'):'土', ('寅', '亥'):'木', ('卯', '戌'):'火', ('辰', '酉'):'金', ('巳', '申'):'水', ('午', '未'):'太阳太阴'}  # 即六合
He_Zhi_3 = {('子', '申', '辰'):'水', ('亥', '卯', '未'):'木', ('寅', '午', '戌'):'火', ('巳', '酉', '丑'):'金'}   # 即三合

# 属相的刑冲害化合
Shengxiao_2_Zhi = {
    '鼠':'子', '牛':'丑', '虎':'寅', '兔':'卯', '龙':'辰', '蛇':'巳',
    '马':'午', '羊':'未', '猴':'申', '鸡':'酉', '狗':'戌', '猪':'亥'
}
He_SX_6 = (('鼠', '牛'), ('虎', '猪'), ('土', '狗'), ('龙', '鸡'), ('蛇', '猴'), ('马', '羊'))
He_SX_3 = (('鼠', '猴', '龙'), ('猪', '土', '羊'), ('虎', '马', '狗'), ('蛇', '鸡', '牛'))
Chong_SX = (('鼠', '马'), ('牛', '羊'), ('虎', '猴'), ('土', '鸡'), ('龙', '狗'), ('蛇', '猪'))
Hai_SX = (('鼠', '羊'), ('牛', '马'), ('虎', '蛇'), ('土', '龙'), ('猴', '猪'), ('鸡', '狗'))





