
class Node(object):
    def __init__(self, name):
        self.name = name
        self.left = None
        self.right = None


class WuXingLink(object):
    def __init__(self):
        self.mu = Node('木')
        self.huo = Node('火')
        self.tu = Node('土')
        self.jin = Node('金')
        self.shui = Node('水')
        self.attrs = [self.mu, self.huo, self.tu, self.jin, self.shui]

    def improve(self):
        self.mu.left = self.shui
        self.mu.right = self.huo
        self.huo.left = self.mu
        self.huo.right = self.tu
        self.tu.left = self.huo
        self.tu.right = self.jin
        self.jin.left = self.tu
        self.jin.right = self.shui
        self.shui.left = self.jin
        self.shui.right = self.mu

    def impair(self):
        self.mu.left = self.jin
        self.mu.right = self.tu
        self.huo.left = self.shui
        self.huo.right = self.jin
        self.tu.left = self.mu
        self.tu.right = self.shui
        self.jin.left = self.huo
        self.jin.right = self.mu
        self.shui.left = self.tu
        self.shui.right = self.huo

    def who_improve_me(self, attr):
        self.improve()
        for node in self.attrs:
            if node.name == attr:
                return node.left.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def me_improve_who(self, attr):
        self.improve()
        for node in self.attrs:
            if node.name == attr:
                return node.right.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def who_impair_me(self, attr):
        self.impair()
        for node in self.attrs:
            if node.name == attr:
                return node.left.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''

    def me_impair_who(self, attr):
        self.impair()
        for node in self.attrs:
            if node.name == attr:
                return node.right.name
        print('错误传参！仅限以下之一：金、木、水、火、土')
        return ''


# 数组LunarMonthDay存入阴历1901年到2050年每年中的月天数信息。阴历每月只能是29或30天，一年用12（或13）个二进制位表示，对应位为1表30天，否则为29天。
LUNARMONTHDAY = [
    0x4ae0, 0xa570, 0x5268, 0xd260, 0xd950, 0x6aa8, 0x56a0, 0x9ad0, 0x4ae8, 0x4ae0,  # 1910
    0xa4d8, 0xa4d0, 0xd250, 0xd548, 0xb550, 0x56a0, 0x96d0, 0x95b0, 0x49b8, 0x49b0,  # 1920
    0xa4b0, 0xb258, 0x6a50, 0x6d40, 0xada8, 0x2b60, 0x9570, 0x4978, 0x4970, 0x64b0,  # 1930
    0xd4a0, 0xea50, 0x6d48, 0x5ad0, 0x2b60, 0x9370, 0x92e0, 0xc968, 0xc950, 0xd4a0,  # 1940
    0xda50, 0xb550, 0x56a0, 0xaad8, 0x25d0, 0x92d0, 0xc958, 0xa950, 0xb4a8, 0x6ca0,  # 1950
    0xb550, 0x55a8, 0x4da0, 0xa5b0, 0x52b8, 0x52b0, 0xa950, 0xe950, 0x6aa0, 0xad50,  # 1960
    0xab50, 0x4b60, 0xa570, 0xa570, 0x5260, 0xe930, 0xd950, 0x5aa8, 0x56a0, 0x96d0,  # 1970
    0x4ae8, 0x4ad0, 0xa4d0, 0xd268, 0xd250, 0xd528, 0xb540, 0xb6a0, 0x96d0, 0x95b0,  # 1980
    0x49b0, 0xa4b8, 0xa4b0, 0xb258, 0x6a50, 0x6d40, 0xada0, 0xab60, 0x9370, 0x4978,  # 1990
    0x4970, 0x64b0, 0x6a50, 0xea50, 0x6b28, 0x5ac0, 0xab60, 0x9368, 0x92e0, 0xc960,  # 2000
    0xd4a8, 0xd4a0, 0xda50, 0x5aa8, 0x56a0, 0xaad8, 0x25d0, 0x92d0, 0xc958, 0xa950,  # 2010
    0xb4a0, 0xb550, 0xb550, 0x55a8, 0x4ba0, 0xa5b0, 0x52b8, 0x52b0, 0xa930, 0x74a8,  # 2020
    0x6aa0, 0xad50, 0x4da8, 0x4b60, 0x9570, 0xa4e0, 0xd260, 0xe930, 0xd530, 0x5aa0,  # 2030
    0x6b50, 0x96d0, 0x4ae8, 0x4ad0, 0xa4d0, 0xd258, 0xd250, 0xd520, 0xdaa0, 0xb5a0,  # 2040
    0x56d0, 0x4ad8, 0x49b0, 0xa4b8, 0xa4b0, 0xaa50, 0xb528, 0x6d20, 0xada0, 0x55b0,  # 2050
]

# 数组LunarMonth存放阴历1901年到2050年闰月的月份，如没有则为0，每字节存两年。
LUNARMONTH = [
    0x00, 0x50, 0x04, 0x00, 0x20,  # 1910
    0x60, 0x05, 0x00, 0x20, 0x70,  # 1920
    0x05, 0x00, 0x40, 0x02, 0x06,  # 1930
    0x00, 0x50, 0x03, 0x07, 0x00,  # 1940
    0x60, 0x04, 0x00, 0x20, 0x70,  # 1950
    0x05, 0x00, 0x30, 0x80, 0x06,  # 1960
    0x00, 0x40, 0x03, 0x07, 0x00,  # 1970
    0x50, 0x04, 0x08, 0x00, 0x60,  # 1980
    0x04, 0x0a, 0x00, 0x60, 0x05,  # 1990
    0x00, 0x30, 0x80, 0x05, 0x00,  # 2000
    0x40, 0x02, 0x07, 0x00, 0x50,  # 2010
    0x04, 0x09, 0x00, 0x60, 0x04,  # 2020
    0x00, 0x20, 0x60, 0x05, 0x00,  # 2030
    0x30, 0xb0, 0x06, 0x00, 0x50,  # 2040
    0x02, 0x07, 0x00, 0x50, 0x03  # 2050
]

START_YEAR = 1901
TIANGAN = '甲乙丙丁戊己庚辛壬癸'
DIZHI = '子丑寅卯辰巳午未申酉戌亥'
SHENGXIAO = '鼠牛虎兔龙蛇马羊猴鸡狗猪'
JIEQI = '小寒大寒立春雨水惊蛰春分清明谷雨立夏小满芒种夏至小暑大暑立秋处暑白露秋分寒露霜降立冬小雪大雪冬至'
JIEQI_JIE = "立春惊蛰清明立夏芒种小暑立秋白露寒露立冬大雪小寒"  # 节气节点，如立春-惊蛰是正月，两个节气一个月
JIEQI_MONTH = {
    "立春": [0, "寅"],
    "惊蛰": [1, "卯"],
    "清明": [2, "辰"],
    "立夏": [3, "巳"],
    "芒种": [4, "午"],
    "小暑": [5, "未"],
    "立秋": [6, "申"],
    "白露": [7, "酉"],
    "寒露": [8, "戌"],
    "立冬": [9, "亥"],
    "大雪": [10, "子"],
    "小寒": [11, "丑"],
}

WUXING = ['金', '木', '水', '火', '土']

GAN_2_WX_YY = {
    '甲': ['木', '阳'],
    '乙': ['木', '阴'],
    '丙': ['火', '阳'],
    '丁': ['火', '阴'],
    '戊': ['土', '阳'],
    '己': ['土', '阴'],
    '庚': ['金', '阳'],
    '辛': ['金', '阴'],
    '壬': ['水', '阳'],
    '癸': ['水', '阴']}

ZHI_2_WX_YY = {
    '子': ['水', '阳'],
    '丑': ['土', '阴'],
    '寅': ['木', '阳'],
    '卯': ['木', '阴'],
    '辰': ['土', '阳'],
    '巳': ['火', '阴'],
    '午': ['火', '阳'],
    '未': ['土', '阴'],
    '申': ['金', '阳'],
    '酉': ['金', '阴'],
    '戌': ['土', '阳'],
    '亥': ['水', '阴'],
}

WX_2_SEASON = {'木': '春', '火': '夏', '金': '秋', '水': '冬', '土': '四季'}

WX_2_DIRECTION = {'木': '东', '火': '南', '金': '西', '水': '北', '土': '中'}

SEASON_WX_TREND = {
    '春': {'木': '旺', '火': '相', '水': '休', '金': '囚', '土': '死'},
    '夏': {'火': '旺', '土': '相', '木': '休', '水': '囚', '金': '死'},
    '秋': {'金': '旺', '水': '相', '土': '休', '火': '囚', '木': '死'},
    '冬': {'水': '旺', '木': '相', '金': '休', '土': '囚', '火': '死'},
    '四季': {'土': '旺', '金': '相', '火': '休', '木': '囚', '水': '死'}
}

# 寄生十二宫
JISHENGSHIERGONG = {
    '甲木': {'亥': '长生', '子': '沐浴', '丑': '冠带', '寅': '临官', '卯': '帝旺', '辰': '衰',
             '巳': '病', '午': '死', '未': '墓', '申': '绝', '酉': '胎', '戌': '养'},
    '丙火': {'寅': '长生', '卯': '沐浴', '辰': '冠带', '巳': '临官', '午': '帝旺', '未': '衰',
             '申': '病', '酉': '死', '戌': '墓', '亥': '绝', '子': '胎', '丑': '养'},
    '戊土': {'寅': '长生', '卯': '沐浴', '辰': '冠带', '巳': '临官', '午': '帝旺', '未': '衰',
             '申': '病', '酉': '死', '戌': '墓', '亥': '绝', '子': '胎', '丑': '养'},
    '庚金': {'巳': '长生', '午': '沐浴', '未': '冠带', '申': '临官', '酉': '帝旺', '戌': '衰',
             '亥': '病', '子': '死', '丑': '墓', '寅': '绝', '卯': '胎', '辰': '养'},
    '壬水': {'申': '长生', '酉': '沐浴', '戌': '冠带', '亥': '临官', '子': '帝旺', '丑': '衰',
             '寅': '病', '卯': '死', '辰': '墓', '巳': '绝', '午': '胎', '未': '养'},
    '乙木': {'午': '长生', '巳': '沐浴', '辰': '冠带', '卯': '临官', '寅': '帝旺', '丑': '衰',
             '子': '病', '亥': '死', '戌': '墓', '酉': '绝', '申': '胎', '未': '养'},
    '丁火': {'酉': '长生', '申': '沐浴', '未': '冠带', '午': '临官', '巳': '帝旺', '辰': '衰',
             '卯': '病', '寅': '死', '丑': '墓', '子': '绝', '亥': '胎', '戌': '养'},
    '己土': {'酉': '长生', '申': '沐浴', '未': '冠带', '午': '临官', '巳': '帝旺', '辰': '衰',
             '卯': '病', '寅': '死', '丑': '墓', '子': '绝', '亥': '胎', '戌': '养'},
    '辛金': {'子': '长生', '亥': '沐浴', '戌': '冠带', '酉': '临官', '申': '帝旺', '未': '衰',
             '午': '病', '巳': '死', '辰': '墓', '卯': '绝', '寅': '胎', '丑': '养'},
    '癸水': {'卯': '长生', '寅': '沐浴', '丑': '冠带', '子': '临官', '亥': '帝旺', '戌': '衰',
             '酉': '病', '申': '死', '未': '墓', '午': '绝', '巳': '胎', '辰': '养'}
}

# 刑冲害化合
XING_ZHI = (('子', '卯'), ('寅', '巳', '申'), ('丑', '未', '戌'))        # 即三刑
CHONG_GAN = (('甲', '庚'), ('乙', '辛'), ('壬', '丙'),  ('癸', '丁'))
Chong_ZHI = (('子', '午'), ('丑', '未'), ('寅', '申'), ('卯', '酉'), ('辰', '戌'), ('巳', '亥'))    # 即六冲
HAI_ZHI = (('子', '未'), ('丑', '午'), ('寅', '巳'), ('卯', '辰'), ('申', '亥'), ('酉', '戌'))      # 即六害
HUA_GAN = (('甲', '己'), ('乙', '庚'), ('丙', '辛'), ('壬', '丁'),  ('癸', '戊'))    # 即五化
HE_ZHI_6 = {('子', '丑'): '土', ('寅', '亥'): '木', ('卯', '戌'): '火', ('辰', '酉'): '金',
            ('巳', '申'): '水', ('午', '未'): '太阳太阴'}  # 即六合
HE_ZHI_3 = {('子', '申', '辰'): '水', ('亥', '卯', '未'): '木', ('寅', '午', '戌'): '火', ('巳', '酉', '丑'): '金'}   # 即三合

# 属相的刑冲害化合
SHENGXIAO_2_ZHI = {
    '鼠': '子', '牛': '丑', '虎': '寅', '兔': '卯', '龙': '辰', '蛇': '巳',
    '马': '午', '羊': '未', '猴': '申', '鸡': '酉', '狗': '戌', '猪': '亥'
}
HE_SHENGXIAO_6 = (('鼠', '牛'), ('虎', '猪'), ('土', '狗'), ('龙', '鸡'), ('蛇', '猴'), ('马', '羊'))
HE_SHENGXIAO_3 = (('鼠', '猴', '龙'), ('猪', '土', '羊'), ('虎', '马', '狗'), ('蛇', '鸡', '牛'))
CHONG_SHENGXIAO = (('鼠', '马'), ('牛', '羊'), ('虎', '猴'), ('土', '鸡'), ('龙', '狗'), ('蛇', '猪'))
HAI_SHENGXIAO = (('鼠', '羊'), ('牛', '马'), ('虎', '蛇'), ('土', '龙'), ('猴', '猪'), ('鸡', '狗'))

LUNAR_MONTH_ZHI_2_NUM = {
    '寅': 1, '卯': 2, '辰': 3, '巳': 4, '午': 5, '未': 6,
    '申': 7, '酉': 8, '戌': 9, '亥': 10, '子': 11, '丑': 12
}

HOUR_2_ZHI = {
    # [1, 2] means [1:00, 3:00)
    '子': [23, 0], '丑': [1, 2], '寅': [3, 4], '卯': [5, 6], '辰': [7, 8], '巳': [9, 10],
    '午': [11, 12], '未': [13, 14], '申': [15, 16], '酉': [17, 18], '戌': [19, 20], '亥': [21, 22]
}

GAN_MONTH_INTENSITY_TABLE = {
    '月支': ['寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥', '子', '丑'],
    '甲': [1.14, 1.2, 1.1, 1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06],
    '乙': [1.14, 1.2, 1.1, 1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06],
    '丙': [1.2, 1.2, 1.06, 1.14, 1.2, 1.1, 1, 1, 1.04, 1, 1, 1],
    '丁': [1.2, 1.2, 1.06, 1.14, 1.2, 1.1, 1, 1, 1.04, 1, 1, 1],
    '戊': [1.06, 1, 1.1, 1.14, 1.2, 1.16, 1, 1, 1.14, 1, 1, 1.1],
    '己': [1.06, 1, 1.1, 1.14, 1.2, 1.16, 1, 1, 1.14, 1, 1, 1.1],
    '庚': [1, 1, 1.1, 1.06, 1, 1.1, 1.14, 1.2, 1.16, 1, 1, 1.14],
    '辛': [1, 1, 1.1, 1.06, 1, 1.1, 1.14, 1.2, 1.16, 1, 1, 1.14],
    '壬': [1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06, 1.14, 1.2, 1.1],
    '癸': [1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06, 1.14, 1.2, 1.1]
}

ZHI_MONTH_INTENSITY_TABLE = {
    '月支': ['藏干', '寅', '卯', '辰', '巳', '午', '未', '申', '酉', '戌', '亥', '子', '丑'],
    '子': ['癸', 1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06, 1.14, 1.2, 1.1],
    '丑': [['癸', 0.3, 0.3, 0.312, 0.318, 0.3, 0.3, 0.36, 0.36, 0.318, 0.342, 0.36, 0.33],
           ['辛', 0.2, 0.2, 0.23, 0.212, 0.2, 0.22, 0.228, 0.248, 0.232, 0.2, 0.2, 0.228],
           ['己', 0.53, 0.5, 0.55, 0.57, 0.6, 0.58, 0.5, 0.5, 0.57, 0.5, 0.5, 0.55]],
    '寅': [['丙', 0.36, 0.36, 0.318, 0.342, 0.36, 0.33, 0.3, 0.3, 0.342, 0.318, 0.3, 0.3],
           ['甲', 0.798, 0.84, 0.77, 0.7, 0.7, 0.728, 0.742, 0.7, 0.7, 0.84, 0.84, 0.742]],
    '卯': ['乙', 1.14, 1.2, 1.1, 1, 1, 1.04, 1.06, 1, 1, 1.2, 1.2, 1.06],
    '辰': [['乙', 0.342, 0.36, 0.33, 0.3, 0.3, 0.312, 0.318, 0.3, 0.3, 0.36, 0.36, 0.318],
           ['癸', 0.2, 0.2, 0.208, 0.2, 0.2, 0.2, 0.24, 0.24, 0.212, 0.228, 0.24, 0.22],
           ['戊', 0.53, 0.5, 0.55, 0.6, 0.6, 0.58, 0.5, 0.5, 0.57, 0.5, 0.5, 0.55]],
    '巳': [['庚', 0.3, 0.3, 0.33, 0.3, 0.3, 0.33, 0.342, 0.36, 0.348, 0.3, 0.3, 0.342],
           ['丙', 0.84, 0.84, 0.742, 0.84, 0.84, 0.798, 0.7, 0.7, 0.728, 0.742, 0.7, 0.7]],
    '午': ['丁', 1.2, 1.2, 1.06, 1.14, 1.2, 1.1, 1, 1, 1.04, 1.06, 1, 1],
    '未': [['丁', 0.36, 0.36, 0.318, 0.342, 0.36, 0.33, 0.3, 0.3, 0.312, 0.318, 0.318, 0.3, 0.3],
           ['乙', 0.228, 0.24, 0.22, 0.2, 0.2, 0.208, 0.212, 0.2, 0.2, 0.24, 0.24, 0.212],
           ['己', 0.53, 0.5, 0.55, 0.57, 0.6, 0.58, 0.5, 0.5, 0.57, 0.5, 0.5, 0.55]],
    '申': [['壬', 0.3, 0.3, 0.312, 0.318, 0.3, 0.3, 0.36, 0.36, 0.318, 0.342, 0.36, 0.33],
           ['庚', 0.7, 0.7, 0.77, 0.742, 0.7, 0.77, 0.798, 0.84, 0.812, 0.7, 0.7, 0.798]],
    '酉': ['辛', 1, 1, 1.1, 1.06, 1, 1.1, 1.14, 1.2, 1.16, 1, 1, 1.14],
    '戌': [['辛', 0.3, 0.3, 0.33, 0.318, 0.3, 0.33, 0.342, 0.36, 0.348, 0.3, 0.3, 0.342],
           ['丁', 0.24, 0.24, 0.212, 0.228, 0.24, 0.22, 0.2, 0.2, 0.208, 0.212, 0.2, 0.2],
           ['戊', 0.53, 0.5, 0.55, 0.57, 0.6, 0.58, 0.5, 0.5, 0.57, 0.5, 0.5, 0.55]],
    '亥': [['甲', 0.342, 0.36, 0.33, 0.3, 0.3, 0.312, 0.318, 0.3, 0.3, 0.36, 0.36, 0.318],
           ['壬', 0.7, 0.7, 0.728, 0.742, 0.7, 0.7, 0.84, 0.84, 0.724, 0.798, 0.84, 0.77]]
}

SIXTY_JIAZI = ['甲子', '乙丑', '丙寅', '丁卯', '戊辰', '己巳', '庚午', '辛未', '壬申', '癸酉', '甲戌', '乙亥',
               '丙子', '丁丑', '戊寅', '己卯', '庚辰', '辛巳', '壬午', '癸未', '甲申', '乙酉', '丙戌', '丁亥',
               '戊子', '己丑', '庚寅', '辛卯', '壬辰', '癸巳', '甲午', '乙未', '丙申', '丁酉', '戊戌', '己亥',
               '庚子', '辛丑', '壬寅', '癸卯', '甲辰', '乙巳', '丙午', '丁未', '戊申', '己酉', '庚戌', '辛亥',
               '壬子', '癸丑', '甲寅', '乙卯', '丙辰', '丁巳', '戊午', '己未', '庚申', '辛酉', '壬戌', '癸亥']
